# Minimal Profile - Ubuntu packages
# Usage: xargs -a apt-packages.minimal sudo apt install -y
git
zsh
vim
tmux
curl
wget
tree
jq
nmap
gnupg2
rsync
htop
psmisc
make
unzip
xclip
# Modern CLI tools
ripgrep
fd-find
bat
fzf
btop
