# Developer Profile - Ubuntu packages
# Usage: xargs -a apt-packages.developer sudo apt install -y
git
vim
tmux
zsh
curl
wget
tree
jq
nmap
gnupg2
rsync
htop
psmisc
make
# Development
build-essential
cmake
dos2unix
shellcheck
gh
python3
python3-pip
python3-venv
golang
ruby
xclip
yamllint
skopeo
# Containers (Docker installed via install-ubuntu-extras.sh from official repo)
